# Задание 1
# Есть список a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89].
# Выведите все элементы, которые меньше 5.
#
# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
# for elem in a:
#     if elem < 5:
#         print(elem)


# Задание 2
# Написать код который будет принимать на вход число, после проверяя его и выводя четное оно или нет
#
# number = int(input('Введите число: '))
# if number % 2 == 0:
#     print('Вы ввели четное число')
# else:
#     print('Вы ввели нечетное число')

# Задание 3
# Введите первый и последний элемент массива
#
# array = [1, 2, 5, 7, 1, 6]
# print(f'Первый элемент: {array[0]}\nПоследний элемент : {array[-1])




# проверка является ли введенное слово полидромом
# word = input('Введите слово: ')
# if word == word[::-1]:
#     print("слово является полиндромом")
# else:
#     print('слово не является полиндромом')


